02_OpenFOAM_FVM/cases/Ejercicio6/cylinder_coarse/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          16;
        startFace       580;
    }
    outlet
    {
        type            patch;
        nFaces          11;
        startFace       596;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          14;
        startFace       607;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          659;
        startFace       621;
    }
)

// ************************************************************************* //
