02_OpenFOAM_FVM/cases/Ejercicio6/cylinder_coarse/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#includeFunc forcesIncompressible
#includeFunc forceCoeffsIncompressible
#includeFunc residuals
#includeFunc streamlinesLine
(
    name=streamlines,
    start=(0.001 -0.002 0),
    end=(0.001 0.002 0),
    nPoints=40,
    U
)

residualsCalc             // unique name #2
    {
        // If your build provides 'residuals':
        type                  residuals;
        functionObjectLibs   ("libutilityFunctionObjects.so");
        enabled               true;

        writeControl          writeTime;
        writeInterval         1;

        fields               (p U k omega nut);
        log                   yes;
    }

// ************************************************************************* //
